app/Controllers/Home.php

    public function index()
    {
        if(!(isset($_SESSION['usuario'])))
    {
        $pModel = model('productos');

        return view('index', ['producto' => $pModel->findAll()]);
    }else{
        $pModel = model('productos');

        return view('index', ['producto' => $pModel->findAll()]);
---
SELECT *
FROM `productos`

    public function shop()
    {
        if(!(isset($_SESSION['usuario'])))
    {
        $pModel = model('productos');
        return view('shop', ['producto' => $pModel->findAll()]);
    }else{
        $pModel = model('productos');
        return view('shop', ['producto' => $pModel->findAll()]);
---
SELECT *
FROM `productos`